[
    {
"title":"Elon Musk Trolled Jeff Bezos, After US Judge Cleared NASA's SpaceX Moon Lander",
"author":"Bharat Sharma",
"published_date":"2021-11-05 12:22:02",
"published_date_precision":"full",
"link":"https://www.indiatimes.com/technology/news/nasa-spacex-moon-lander-elon-musk-jeff-bezos-553442.html",
"clean_url":"indiatimes.com",
"summary":"The US Court of Federal Claims on Thursday ruled in favour of Elon Musk's SpaceX while sidelining Jeff Bezos' Blue Origin after the latter filed a lawsuit against NASA for giving SpaceX an expensive lunar lander contract.Also Read: Elon Musk Will End World Hunger With $6 Billion, If UN Has The Right Plan SpaceX + NASAAfter months of back-and-forth jibes on Twitter (yes, Musk, we're looking at you), the court bought long-sought resolution for NASA, SpaceX, and Blue Origin alike.In classic Musk style, a meme-inspired reaction followed the news from the 2012 film\"Dredd saying you have been judged.",
"rights":"indiatimes.com",
"rank":325,
"topic":"tech",
"country":"IN",
"language":"en",
"media":"https://im.indiatimes.in/content/2021/Oct/Facebook-Image---2021-10-11T190559578_61643e4941346.jpg",
"is_opinion":false,
"twitter_account":"NULL",
"_score":24.066694,
"_id":"f51405161b37b8b19dfd190d64a208cf"
},
{
"title":"$25 Billion Elon Musk Twitter Poll: Musk Asks If He Should Sell Tesla Stock To Pay Taxes",
"author":"John Koetsier",
"published_date":"2021-11-06 19:49:20",
"published_date_precision":"full",
"link":"https://www.forbes.com/sites/johnkoetsier/2021/11/06/25-billion-elon-musk-twitter-poll-musk-asks-if-he-should-sell-stock-to-pay-taxes/",
"clean_url":"forbes.com",
"summary":"SpaceX and Tesla CEO Elon Musk just launched a Twitter poll that is literally worth over $25 billion. Musk, who doesn't take a significant salary and whose wealth is therefore protected from taxation as his companies' valuations grow, is asking his Twitter followers if he should sell Tesla stock in order to pay tax. This is no idle tweet: Musk says he will abide by the results of the poll ... whichever way it goes. A screenshot of Elon Musk's poll John Koetsier Tesla's market capitalization, according to Yahoo Finance, is currently $1.",
"rights":"forbes.com",
"rank":51,
"topic":"news",
"country":"US",
"language":"en",
"media":"https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6186dc1be438691370502546%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D3720%26cropY1%3D109%26cropY2%3D2203",
"is_opinion":false,
"twitter_account":"@johnkoetsier",
"_score":23.958155,
"_id":"380b1f95aa19e97462dd638757a2a739"
},
{
"title":"Elon Musk should sell 10% of his Tesla stock, Twitter poll says",
"author":"Nina Mandell",
"published_date":"2021-11-07 20:43:41",
"published_date_precision":"full",
"link":"https://www.usatoday.com/story/money/2021/11/07/elon-musk-tesla-stock-twitter-poll/6331853001/",
"clean_url":"usatoday.com",
"summary":"Elon Musk could become a trillionaire. Here's what that means.Elon Musk could become the world's first trillionaire. Here's what that means.Twitter has spoken and if Tesla CEO Elon Musk follows through with his promise to abide by the results, he will sell 10% of his stock in the electric car company, a sale which is reported to be worth more than $25 billion.Nearly 58% of respondents on Twitter voted yes to the poll Musk tweeted on Saturday: \"Much is made lately of unrealized gains being a means of tax avoidance, so I propose selling 10% of my Tesla stock.",
"rights":"usatoday.com",
"rank":126,
"topic":"news",
"country":"US",
"language":"en",
"media":"https://www.gannett-cdn.com/presto/2021/10/08/USAT/b850ce50-3268-452e-ac7e-87cdde3d02e3-AFP_AFP_9PD2LC.jpg?auto=webp&crop=4644,2613,x0,y286&format=pjpg&width=1200",
"is_opinion":false,
"twitter_account":"@usatoday",
"_score":23.9004,
"_id":"bac56bb19edf9f959e6effe273a7f788"
},
{
"title":"Elon Musk should sell 10% of Tesla stock, Twitter users vote",
"author":"Bradford Betz",
"published_date":"2021-11-07 21:43:43",
"published_date_precision":"full",
"link":"https://www.foxbusiness.com/technology/elon-musk-twitter-poll-tesla-stock",
"clean_url":"foxbusiness.com",
"summary":"Elon Musk's Twitter followers weighed in this weekend on whether the Tesla CEO should sell 10% of his stock in the company.  The Twitter poll, which garnered more than 3.5 million votes closed Sunday, with nearly 58% in favor of Musk's proposition and more than 42% against the idea.  FILE: Tesla CEO Elon Musk speaks before unveiling the Model Y at the company's design studio in Hawthorne, Calif.  (AP) Musk said he would abide by the results of the poll, whatever the outcome may have been. The tweet came amid some Democrats pushing for billionaires to pay taxes when the price of the stocks they hold goes up, even if they don't sell any shares.",
"rights":"foxbusiness.com",
"rank":943,
"topic":"tech",
"country":"US",
"language":"en",
"media":"https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/11/0/0/Elon-Musk.png?ve=1&tl=1",
"is_opinion":false,
"twitter_account":"@FoxBusiness",
"_score":23.393484,
"_id":"dcc5e1557967d70ea182f7db76d223a8"
    }
]